Tekla Open API Reference for Tekla Structures 2025
AnalysisMaterial.PoissonsRatio Property
 Gets or sets the Poisson's ratio of the analysis material.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double PoissonsRatio { get; set; }
Public Property PoissonsRatio As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnalysisMaterial Class
Tekla.Structures.Analysis Namespace